#Область ПрограммныйИнтерфейс

// Функция - Получить сохраненные настройки
//
// Параметры:
//  ДополнительнаяОбработкаСсылка	 - СправочникСсылка.ДополнительныеОтчетыИОбработки - доп обработка, хранилищенастроек которой используется для хранения таблицы с датами выплат по периодам.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - даты выплат по периодам. Содержит колонки: 
// 	 * Период - Дата - первое число месяца периода
//   * ПланируемаяДатаВыплатыАванс - Дата - дата выплаты аванса за период.
//   * ПланируемаяДатаВыплатыЗарплата - Дата - дата выплаты зарплаты за период.
//
Функция ПолучитьСохраненныеНастройки(ДополнительнаяОбработкаСсылка) Экспорт 
	Если ЗначениеЗаполнено(ДополнительнаяОбработкаСсылка) Тогда
		ХранилищеНастроек = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДополнительнаяОбработкаСсылка,"ХранилищеНастроек");
		СохрНастройки = ХранилищеНастроек.Получить();
		Если СохрНастройки <> Неопределено И ТипЗнч(СохрНастройки)=Тип("ТаблицаЗначений")  Тогда
			 Возврат СохрНастройки;
		 КонецЕсли;	  
	 Иначе
		 Возврат Неопределено;
	КонецЕсли;	

КонецФункции

// Функция - Получить ссылку на обработку хранилище
// 
// Параметры:
//  СоздатьОбработкуХранилище  - Булево - создавать обработку в случае ее отсутствия в справочнике ДополнительныеОтчетыИОбработки.
// 
// Возвращаемое значение:
//   - СправочникСсылка.ДополнительныеОтчетыИОбработки - доп обработка, хранилищенастроек которой используется для хранения таблицы с датами выплат по периодам. 
//
Функция ПолучитьСсылкуНаОбработкуХранилище(СоздатьОбработкуХранилище) Экспорт
	
	НаименованиеОбработки=ПолучитьНаименованиеДополнительнойОбработки();
	
	ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОбработки);
	
	//дополнительная обработка не найдена, создаем
	Если НЕ ЗначениеЗаполнено(ДополнительнаяОбработкаСсылка) И СоздатьОбработкуХранилище Тогда
		ДополнительнаяОбработкаОбъект = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		ДополнительнаяОбработкаОбъект.Наименование=НаименованиеОбработки;  
		ДополнительнаяОбработкаОбъект.ИспользоватьДляФормыОбъекта = Истина;
		ДополнительнаяОбработкаОбъект.ИспользоватьДляФормыСписка  = Истина;
		ДополнительнаяОбработкаОбъект.Ответственный               = Пользователи.ТекущийПользователь();
		ДополнительнаяОбработкаОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Отключена;
		ДополнительнаяОбработкаОбъект.Записать();
		ДополнительнаяОбработкаСсылка=ДополнительнаяОбработкаОбъект.Ссылка;
	КонецЕсли;                            
	
	Возврат ДополнительнаяОбработкаСсылка;
	
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Функция - Получить наименование дополнительной обработки
// 
// Возвращаемое значение:
//  Строка - наименование доп обработки
//
Функция ПолучитьНаименованиеДополнительнойОбработки()
	Возврат "Настройки периодических планируемых дат выплаты зарплаты (служебная).";
КонецФункции    

#КонецОбласти