#Область ПланируемаяДатаВыплатыЗарплаты
&Вместо("ПланируемаяДатаВыплатыЗарплатыПоНастройкамПоПорядкуВыплаты")
Функция ГСП_ПланируемаяДатаВыплатыЗарплатыПоНастройкамПоПорядкуВыплаты(Параметры)
	
	Результат = ПродолжитьВызов(Параметры);
	
	ДополнительнаяОбработкаСсылка = ГСП_ОбщийМодульСервер.ПолучитьСсылкуНаОбработкуХранилище(Ложь); 
	
	СохрНастройки =ГСП_ОбщийМодульСервер.ПолучитьСохраненныеНастройки(ДополнительнаяОбработкаСсылка);
	
	Если СохрНастройки <> Неопределено И ТипЗнч(СохрНастройки)=Тип("ТаблицаЗначений")  Тогда
		НайденныеСтроки=СохрНастройки.НайтиСтроки(Новый Структура("Период",Параметры.МесяцНачисления));
		Если НайденныеСтроки.Количество()>0 ТОгда
			Если Параметры.ПорядокВыплаты=Перечисления.ХарактерВыплатыЗарплаты.Аванс Тогда
				Результат=НайденныеСтроки[0].ПланируемаяДатаВыплатыАванс;
			Иначе	
				Результат=НайденныеСтроки[0].ПланируемаяДатаВыплатыЗарплата;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;	  
	
	Возврат Результат;

КонецФункции
#КонецОбласти

