#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ПериодОбменаПитание Экспорт;
Перем КаталогОбменаПитание Экспорт;
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Сведения о внешней обработке.
// 
// Возвращаемое значение:
//  Структура - Сведения о внешней обработке:
// * Вид - Строка - 
// * Версия - Строка - 
// * Назначение - Массив - 
// * Наименование - Неопределено - 
// * БезопасныйРежим - Булево - 
// * Информация - Неопределено - 
// * ВерсияБСП - Строка - 
// * ОпределитьНастройкиФормы - Булево - 
// * НазначениеВариантаОтчета - ПеречислениеСсылка.НазначенияВариантовОтчетов - 
// * Команды - ТаблицаЗначений - :
// ** Представление 
// ** Идентификатор 
// ** Использование - Строка - 
// ** ПоказыватьОповещение 
// ** Модификатор 
// ** Скрыть 
// ** ЗаменяемыеКоманды 
// * Разрешения - Массив - 
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(
		СтандартныеПодсистемыВызовСервера.ВерсияБиблиотеки());
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Наименование = "Ввод планирумых дат выплаты";

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	
	//представление команды в пользовательском режиме
	НоваяКоманда.Представление = "Настройка дат выплаты";
	НоваяКоманда.Идентификатор = НоваяКоманда.Представление;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();

	Возврат ПараметрыРегистрации;

КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполнения) Экспорт
 	СохрНастройки = ПараметрыВыполнения.ДополнительнаяОбработкаСсылка.ХранилищеНастроек.Получить();
	Если СохрНастройки = Неопределено Тогда
		Возврат;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СохрНастройки);
	КонецЕсли;
	
	Если ИдентификаторКоманды = "Настройка дат выплаты" Тогда
		//открыть форму настройки
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#КонецОбласти
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли